SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy2.upload.tool=avrdude

atxy2.menu.bootmenu.none=none
atxy2.menu.bootmenu.none.upload.protocol=jtag2updi
atxy2.menu.bootmenu.none.upload.extra_params=-e
atxy2.menu.bootmenu.none.build.text_section_start=.text=0x0
atxy2.menu.bootmenu.none.bootloader.BOOTEND=0x0

atxy2.menu.bootmenu.optiboot=optiboot_x
atxy2.menu.bootmenu.optiboot.upload.protocol=arduino
atxy2.menu.bootmenu.optiboot.upload.extra_params=-D
atxy2.menu.bootmenu.optiboot.build.text_section_start=.text=0x200
atxy2.menu.bootmenu.optiboot.bootloader.file=optiboot_x/optiboot_atxy2.hex
atxy2.menu.bootmenu.optiboot.atxt2.bootloader.BOOTEND=0x2

atxy2.bootloader.tool=avrdude

atxy2.menu.uartpins.alternate=TX:2, RX:3
atxy2.menu.uartpins.standard=TX:0, RX:1
atxy2.menu.uartpins.alternate.build.uartpins=-DUARTREMAP
atxy2.menu.uartpins.standard.build.uartpins=

atxy2.build.board=attinyxy2
atxy2.build.core=arduino
atxy2.build.variant=txy2
atxy2.build.text_section_start=.text=0x0
atxy2.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP {build.dacvref} -DNEOPIXELPORT=VPORTA.OUT {build.millis} {build.uartpins}
atxy2.build.export_merged_output=false

atxy2.bootloader.tool=avrdude
atxy2.bootloader.WDTCFG=0x00
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits} 
atxy2.bootloader.TCD0CFG=0x00
atxy2.bootloader.SYSCFG0=0xC9
atxy2.bootloader.SYSCFG1=0x03
atxy2.bootloader.APPEND=0x00
#atxy2.bootloader.BOOTEND=0x00

#

Xplained817.name=Attiny817 Xplained Mini
Xplained817.build.mcu=attiny817
Xplained817.upload.maximum_size=8192
Xplained817.upload.maximum_data_size=512
Xplained817.build.board=attinyxy7
Xplained817.build.board=attinyxy7
Xplained817.build.core=arduino
Xplained817.build.variant=txy7
Xplained817.build.f_cpu=20000000
Xplained817.build.text_section_start=.text=0x200
Xplained817.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DDACVREF=3 -DNEOPIXELPORT=VPORTA.OUT

Xplained416.name=Attiny416 Xplained Nano
Xplained416.build.mcu=attiny416
Xplained416.build.board=attinyxy6
Xplained416.build.core=arduino
Xplained416.build.variant=txy6
Xplained416.build.f_cpu=20000000
Xplained416.build.text_section_start=.text=0x200
Xplained416.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DDACVREF=3 -DNEOPIXELPORT=VPORTA.OUT
Xplained416.upload.tool=avrdude
Xplained416.upload.workaround=
Xplained416.upload.speed=57600
Xplained416.upload.maximum_size=3584
Xplained416.upload.maximum_data_size=256
Xplained416.upload.protocol=arduino
Xplained416.upload.extra_params=-D

Xplained817.name=Attiny817 Xplained Mini
Xplained817.build.mcu=attiny817
Xplained817.build.board=attinyxy7
Xplained817.build.core=arduino
Xplained817.build.variant=txy7
Xplained817.build.f_cpu=20000000
Xplained817.build.text_section_start=.text=0x200
Xplained817.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DDACVREF=3 -DNEOPIXELPORT=VPORTA.OUT
Xplained817.upload.tool=avrdude
Xplained817.upload.workaround=
Xplained817.upload.speed=57600
Xplained817.upload.maximum_size=7680
Xplained817.upload.maximum_data_size=512
Xplained817.upload.protocol=arduino
Xplained817.upload.extra_params=-D
